extras/18_Service_Tasks/serviceTier/src/test/resources/policy_soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:com.redhat.gpe.auditReview:1.0">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:addPolicy>
         <arg0>
            <driver>
                <age>22</age>
                <creditScore>600</creditScore>
                <dlNumber>xxxx</dlNumber>
                <driverName>alex</driverName>
                <numberOfAccidents>0</numberOfAccidents>
                <numberOfTickets>1</numberOfTickets>
                <ssn>111223333</ssn>
            </driver>
            <policyType>AUTO</policyType>
            <price>500</price>
            <vehicleYear>2014</vehicleYear>
         </arg0>
      </urn:addPolicy>
   </soapenv:Body>
</soapenv:Envelope>
